Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.Insert Method
 Insert analysis result. Results are always stored to physical parts. When OBJECT_TYPE_MEMBER or OBJECT_TYPE_AREA is used the analysis model must be active. All results for given part must be inserted within one commit (CommitChanges), older results of this part are removed automatically.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Insert()
Public Function Insert As Boolean
Return Value
Type: Boolean
True if successful.
Examples
 Insert analysis result using analysis bar number.
var analysisResult = new AnalysisResult();
analysisResult.ObjectType = AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_MEMBER;
analysisResult.ObjectId = analysisBar.Label.Number;
analysisResult.Position = AnalysisResult.ResultPositionEnum.POSITION_BEAM_START_POINT;
analysisResult.ValueType = AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y;
analysisResult.LoadCase = 1;
analysisResult.LoadCaseName = "ULS1";
analysisResult.LoadCaseType = LoadCaseTypeEnum.COMBINATION_ULS;
analysisResult.LoadCaseInfo = "TSD class: Gravity";
analysisResult.Value = 100000.0;
var result = analysisResult.Insert();
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace